Seeed-Solution/wio-claude-buddy/firmware/claude_buddy_indicator/sdkconfig.defaults
# Chip-level settings mirror the BSP's indicator_basis example (the vendor's
# validated config for this exact module: OCT PSRAM @120MHz, QIO 8MB flash).
# Display/LVGL settings join in Phase 2 with the bsp component.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_120M=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
